import React from 'react';

const Blog = () => {
    return (
        <div className='container'>
            <h2>Difference between javascript and nodejs</h2>
            <h4>
                জাভাস্ক্রিপ্ট একটি প্রোগ্রামিং ভাষা, যা ওয়েব ব্রাউজারে চলে। যেখানে Node.js হল জাভাস্ক্রিপ্টের জন্য একটি ইন্টারপ্রেটার বা চলমান পরিবেশ, যেটিতে প্রচুর লাইব্রেরি এবং সমস্ত প্রয়োজন। জাভাস্ক্রিপ্ট মূলত একটি আদর্শ সংজ্ঞায়িত প্রোগ্রামিং ভাষা; এটি একটি ডিফল্ট ব্রাউজার চলমান পরিবেশের সাথে যেকোনো ব্রাউজার চালাতে পারে। এটি একটি খুব শক্তিশালী ভাষা যা সাধারণত কোনো যাচাই বা কোনো নির্দিষ্ট ব্যবসায়িক যুক্তিতে একটি ওয়েব অ্যাপ্লিকেশনের জন্য ব্যবহৃত হয়। আমাদের পৃষ্ঠা রিফ্রেশ না করে স্ক্রিনে যুক্ত করতে হবে। জাভাস্ক্রিপ্ট যেকোনো সময় Ajax ব্যবহার করতে সাহায্য করে, যা আমাদের প্রয়োজনীয়তার উপর ভিত্তি করে প্রদত্ত গতিশীল ডেটার জন্য যেকোনো সার্ভার-সাইড স্ক্রিপ্ট কল করতে সাহায্য করে। এটি ব্যবসার প্রয়োজনীয়তার উপর ভিত্তি করে গতিশীল এইচটিএমএল টেবিল তৈরি করতে সহায়তা করে। JQuery হল একটি জনপ্রিয় লাইব্রেরি যা জাভাস্ক্রিপ্টের আরামদায়ক ব্যবহার করার জন্য প্রচুর কোড লেখা এড়িয়ে যায়।
            </h4>
            <br />
            <br />
            <h2>When should you use nodejs and when should you use mongodb</h2>
            <h4>
                Node: জাভাস্ক্রিপ্ট দ্বারা ওয়েবসাইট তৈরি করার জন্য ব্যাকএন্ড আর জন্য ব্যবহার করতে হয়।  জাভাস্ক্রিপ্ট রান-টাইম এনভাইরোনমেন্ট যা ব্রাউজারের বাইরে টার্মিনালে কম্পাইল করা হয়, এটি মূলত সার্ভার সাইড স্ক্রিপ্টিং ও কমান্ড লাইন টুল এর জন্য ব্যাবহৃত হয়
                Mongodb :যখন আমাদের ওয়েবসাইটের ডাটাগুলো অন্য কোথায় হোস্ট করতে প্রয়োজন হবে তখন আমরা MonGodb ব্যবহার করবো।
            </h4>
            <br />
            <br />
            <h2>Differences between sql and nosql databases.</h2>
            <h4>
                1. SQL  ডাটাবেসগুলি সম্পর্কযুক্ত, নোএসকিউএল ডেটাবেসগুলি সম্পর্কহীন।
                <br />
                2. SQL ডাটাবেস স্ট্রাকচার্ড কোয়েরি ভাষা ব্যবহার করে এবং একটি পূর্বনির্ধারিত স্কিমা থাকে। নোএসকিউএল ডাটাবেসে অসংগঠিত ডেটার জন্য গতিশীল স্কিমা রয়েছে।
                <br />
                3. SQL ডাটাবেসগুলি উল্লম্বভাবে স্কেলযোগ্য, যখন NoSQL ডেটাবেসগুলি অনুভূমিকভাবে স্কেলযোগ্য।
                <br />
                4. SQL ডাটাবেসগুলি টেবিল-ভিত্তিক, যখন NoSQL ডাটাবেসগুলি নথি, কী-মান, গ্রাফ, বা প্রশস্ত-কলাম স্টোর।
                <br />
                5. এসকিউএল ডাটাবেসগুলি বহু-সারি লেনদেনের জন্য ভাল, যখন নথি বা JSON এর মতো অসংগঠিত ডেটার জন্য NoSQL ভাল।
            </h4>
            <br />
            <br />
            

        </div>
    );
};

export default Blog;